{
  "connections": [
    {
      "id": "conn-009-rayner",
      "from": "MAG-009",
      "to": "MAG-007",
      "type": "character",
      "color": "#8B4513",
      "label": "Joseph Rayner / Maxwell Rayner",
      "description": "Joseph Rayner is the soldier whose remains were found near Wilfred Owen in MAG-007. Maxwell Rayner is the defrocked minister who led the Peoples' Church of the Divine Host, mentioned in MAG-009. Jonathan Sims notes the name familiarity, suggesting a possible link.",
      "episodes": ["MAG-007", "MAG-009"],
      "strength": "medium",
      "evidence": "In MAG-007, Joseph Rayner is the dead soldier found near Owen. In MAG-009, Maxwell Rayner is the cult leader whose pendant symbol appears on victims. Jonathan Sims explicitly notes recognizing the name Rayner.",
      "characters": ["Joseph Rayner", "Maxwell Rayner"]
    },
    {
      "id": "conn-011-gertrude",
      "from": "MAG-011",
      "to": "MAG-001",
      "type": "character",
      "color": "#4B0082",
      "label": "Gertrude Robinson",
      "description": "Gertrude Robinson is mentioned as the previous Head Archivist who died under unclear circumstances. She is first referenced in MAG-001, and her mysterious death is pondered in MAG-011.",
      "episodes": ["MAG-001", "MAG-011"],
      "strength": "medium",
      "evidence": "In MAG-011, Jonathan Sims reflects on Gertrude's death and her absence. In MAG-001, she is mentioned as the former archivist whose chaotic filing system he inherited.",
      "characters": ["Gertrude Robinson"]
    },
    {
      "id": "conn-011-folger",
      "from": "MAG-011",
      "to": "MAG-003",
      "type": "character",
      "color": "#DAA520",
      "label": "Graham Folger",
      "description": "Antonio Blake mentions his ex-boyfriend Graham. which may be the same Graham who was replaced by 'Not-Graham' in MAG-003.",
      "episodes": ["MAG-003", "MAG-011"],
      "strength": "low",
      "evidence": "Blake refers to his ex-boyfriend Graham.",
      "characters": ["Graham Folger", "Antonio Blake"]
    },
    {
      "id": "conn-012-gerard-keay",
      "from": "MAG-012",
      "to": "MAG-004",
      "type": "character",
      "color": "#8B0000",
      "label": "Gerard Keay",
      "description": "Gerard Keay appears in MAG-012 as a burned patient who kills a cultist. He is the son of Mary Keay, owner of Pinhole Books in MAG-004, and was acquitted of her murder.",
      "episodes": ["MAG-004", "MAG-012"],
      "strength": "high",
      "evidence": "In MAG-012, Gerard Keay is identified as the burned man with eye tattoos. In MAG-004, he is mentioned as Mary Keay's son who was acquitted of her murder.",
      "characters": ["Gerard Keay"]
    },
    {
      "id": "conn-016-elnthorne",
      "from": "MAG-016",
      "to": "MAG-006",
      "type": "location",
      "color": "#808080",
      "label": "Elthorne Road, Archway",
      "description": "Elthorne Road is referenced in MAG-016 as a nearby residential street, and is the location of the attack described in MAG-006.",
      "episodes": ["MAG-006", "MAG-016"],
      "strength": "low",
      "evidence": "MAG-016: 'While nearby Elthorne Road was full of houses and gardens...' MAG-006: 'Elthorne Road, Archway, London, England' is a documented location.",
      "characters": [],
      "location_relation": "Same London district, street mentioned in both."
    },
    {
      "id": "conn-017-leitner",
      "from": "MAG-017",
      "to": "MAG-004",
      "type": "organization",
      "color": "#8B0000",
      "label": "Jurgen Leitner / Leitner Books",
      "description": "The book 'The Boneturner's Tale' is explicitly identified as another volume from the library of Jurgen Leitner, first mentioned in MAG-004 ('Ex Altiora'). Jonathan Sims confirms the connection and expresses concern.",
      "episodes": ["MAG-004", "MAG-017"],
      "strength": "high",
      "evidence": "MAG-017: Sebastian finds a library label underneath for 'Jergensburg or Jurgenleit'. Sims states: 'I've already uncovered evidence of two separate surviving books from Jurgen Leitner's library.' MAG-004 first introduced Leitner and his dangerous books.",
      "characters": ["Jurgen Leitner"],
      "item": "The Boneturner's Tale"
    },
    {
      "id": "conn-017-michaelcrew",
      "from": "MAG-017",
      "to": "MAG-004",
      "type": "character",
      "color": "#4B0082",
      "label": "Michael Crew",
      "description": "Michael Crew is identified as the person who returned 'The Boneturner's Tale' to Chiswick Library. He was previously mentioned in MAG-004 as the childhood friend of statement giver Dominic Swain, who was struck by lightning and bears Lichtenberg scars.",
      "episodes": ["MAG-004", "MAG-017"],
      "strength": "medium",
      "evidence": "MAG-017: 'His name, at least according to his library card, was Michael Crew'. MAG-004: Dominic Swain states 'His name was Michael Crew' and describes him as his childhood friend struck by lightning.",
      "characters": ["Michael Crew"]
    },
    {
      "id": "conn-018-clapham",
      "from": "MAG-018",
      "to": "MAG-003",
      "type": "location",
      "color": "#808080",
      "label": "Clapham, London",
      "description": "Christof Rudenko mentions moving to a house in Clapham with friends after the events at Welbeck House. Clapham is also the location of Amy Patel's flat in MAG-003, where she witnessed the creature and 'Not-Graham'.",
      "episodes": ["MAG-003", "MAG-018"],
      "strength": "low",
      "evidence": "MAG-018: 'I did move out in the end, and now live in a house in Clapham with some friends.' MAG-003: Location is 'Clapham, London, England'.",
      "characters": [],
      "location_relation": "Same London district mentioned in both statements."
    },
    {
      "id": "conn-019-008-location",
      "from": "MAG-019",
      "to": "MAG-008",
      "type": "location",
      "color": "#8B4513",
      "label": "105 Hill Top Road",
      "description": "Father Burroughs visits Hill Top Road, the same house from Ivo Lensik's statement in MAG-008. Both experience supernatural phenomena at this location.",
      "episodes": ["MAG-008", "MAG-019"],
      "strength": "high",
      "evidence": "MAG-019: Burroughs is called to 'a house up on Hill Top Road' where he experiences intense heat. MAG-008: Ivo Lensik's statement about supernatural events at 105 Hill Top Road.",
      "locations": ["105 Hill Top Road, Oxford"]
    },
    {
      "id": "conn-019-008-ivo",
      "from": "MAG-019",
      "to": "MAG-008",
      "type": "character",
      "color": "#DAA520",
      "label": "Ivo Lensik",
      "description": "The 'builder' or 'gentleman' treated at John Radcliffe Hospital and mentioned in Burroughs' statement is Ivo Lensik, the statement giver from MAG-008.",
      "episodes": ["MAG-008", "MAG-019"],
      "strength": "high",
      "evidence": "MAG-019: 'a gentleman had been admitted to the John Radcliffe after having something of a scare in a house up on Hill Top Road.' MAG-008: Ivo Lensik gives statement about Hill Top Road experiences.",
      "characters": ["Ivo Lensik"]
    },
    {
      "id": "conn-019-008-annie",
      "from": "MAG-019",
      "to": "MAG-008",
      "type": "character",
      "color": "#8B0000",
      "label": "Anne 'Annie' Kasuma-Willett",
      "description": "Anne Kasuma-Willett is named in MAG-008 as a witness to Agnes Montague's death and appears in MAG-019 as the nurse who contacts Father Burroughs.",
      "episodes": ["MAG-008", "MAG-019"],
      "strength": "high",
      "evidence": "MAG-019: Annie is the nurse who calls Burroughs. MAG-008 Archivist Note: 'Agnes Montague died in Sheffield in 2006 with a severed hand chained to her waist. Anne Kasuma-Willett witnessed this.'",
      "characters": ["Anne Kasuma-Willett"]
    },
    {
      "id": "conn-020-breekon-hope",
      "from": "MAG-020",
      "to": "MAG-002",
      "type": "organization",
      "color": "#4B0082",
      "label": "Breekon & Hope Deliveries",
      "description": "Breekon & Hope delivered a pale yellow stole to The Oratory in Oxford, which vanished shortly after. This is the same delivery service that delivered the mysterious coffin in MAG-002.",
      "episodes": ["MAG-002", "MAG-020"],
      "strength": "high",
      "evidence": "MAG-020 Archivist Note: 'the package was handed to them by a company called Breekon and Hope Deliveries.' MAG-002 Supplemental: 'Breekon and Hope delivery service existed but records are unavailable.'",
      "organizations": ["Breekon & Hope Deliveries"]
    },
    {
      "id": "conn-020-bullingdon-repeat",
      "from": "MAG-020",
      "to": "MAG-019",
      "type": "location",
      "color": "#808080",
      "label": "89 Bullingdon Road",
      "description": "The location of Father Burroughs' crimes (the murder of two students) as revealed in the MAG-020 investigation, is the same house from MAG-019 where he first encountered the 'Mentis' writing.",
      "episodes": ["MAG-019", "MAG-020"],
      "strength": "high",
      "evidence": "MAG-020 Archivist Note: 'Father Burroughs was found in one of the back rooms of 89 Bullingdon Road.' This is the same address investigated in MAG-019.",
      "locations": ["89 Bullingdon Road, Oxford"],
      "relationship": "crime_scene"
    },
    {
      "id": "conn-022-vittery",
      "from": "MAG-022",
      "to": "MAG-016",
      "type": "location",
      "color": "#8B4513",
      "label": "Boothby Road Investigation",
      "description": "Martin Blackwood's statement is a direct follow-up to his investigation of Carlos Vittery's flat at Boothby Road, the primary location from MAG-016.",
      "episodes": ["MAG-016", "MAG-022"],
      "strength": "high",
      "evidence": "MAG-022 begins with Martin describing his investigation of 'that flat that he lived in down in Boothby Road', referring to Carlos Vittery from MAG-016.",
      "characters": ["Martin Blackwood", "Carlos Vittery"],
      "locations": ["Boothby Road, Archway, London"]
    },
    {
      "id": "conn-022-prentiss",
      "from": "MAG-022",
      "to": "MAG-006",
      "type": "character",
      "color": "#556B2F",
      "label": "Jane Prentiss",
      "description": "Martin identifies the worm-infested entity in the basement as Jane Prentiss, the same 'witch' or parasite-host from Timothy Hodge's statement (MAG-006).",
      "episodes": ["MAG-006", "MAG-022"],
      "strength": "high",
      "evidence": "Martin states: 'I realized that this woman must be that Jane Prentiss you were telling us about.' He also references the 'case where that woman... burst into worms' from MAG-006.",
      "characters": ["Jane Prentiss", "Martin Blackwood", "Timothy Hodge"]
    },
    {
      "id": "conn-023-keay-lineage",
      "from": "MAG-023",
      "to": "MAG-004",
      "type": "character",
      "color": "#8B0000",
      "label": "Von Closen -> Keay Family Lineage",
      "description": "Archivist research reveals Wilhelm von Closen (Albrecht's nephew) is a direct ancestor of Mary Keay (owner of Pinhole Books from MAG-004). This connects the historical German statement to the modern Leitner book plotline.",
      "episodes": ["MAG-023", "MAG-004"],
      "strength": "high",
      "evidence": "MAG-023 Supplemental: '...one branch emigrated to England in 1908. They had a daughter, Elsa, who went on to marry a man by the name of Michael Keay in 1920. In 1924, they had one daughter, whose name was Mary Keay.'",
      "characters": ["Albrecht von Closen", "Wilhelm von Closen", "Mary Keay"]
    }
  ]
}